Makro/Pruebas/Prueba 16.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|01|F|SETT|4001141|2022-03-23|18:19:00|COP||1|31|900059238|MAKRO|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|2|13|78020389|GABRIEL JOAQUIN OSORIO PETRO|GABRIEL JOAQUIN OSORIO PETRO||||||MONTERIA|CL 9 C 23 57|CO|49|68852.56|68852.56|81299.00|0.00|0.00|0.00|81299.00
ENEX|UBL 2.1|10|||||||2022-02-05||18:19:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|CORDOBA|23|Cra.  14  No.  48 A 42 |CO|Colombia||13|||23001|MONTERIA|CORDOBA|23|CL 9 C 23 57|CO|Colombia||13|7|16FD|01552666|23|Colombia|23001|CORDOBA|Colombia|23|111711|111711
RS|2019-01-19|2030-01-19|SETT|1|50000000||18760000001
DE|1|521729|C62|1.00|19579.83|19579.83||0.00||false
DEDI|LIMPIADOR ARO CANELA 10l
DEDI|23300.00
DEDIEX||999|1|||
DEIM|3720.17|19579.83|3720.17|19.00|01|IVA||C62|3720.17
DE|2|95517|MLT|1.00|5210.08|5210.08||0.00||false
DEDI|BLANQUEADOR ARO ORIGINAL 4L
DEDI|6200.00
DEDIEX||999|1|||
DEIM|989.92|5210.08|989.92|19.00|01|IVA||MLT|989.92
DE|3|6003|BG|1.00|21596.64|21596.64||0.00||false
DEDI|BOLSA BAS ARO TIPO RESID65-80X80u
DEDI|25700.00
DEDIEX||999|1|||
DEIM|4103.36|21596.64|4103.36|19.00|01|IVA||BG|4103.36
DE|4|121164|PA|1.00|10845.38|10845.38||0.00||false
DEDI|CERVEZA CORONITA EXTRA 210mlX6u
DEDI|12906.00
DEDIEX||999|1|||
DEIM|2060.62|10845.38|2060.62|19.00|01|IVA||PA|2060.62
DE|5|121165|PA|1.00|1094.00|1094.00||||false
DEDI|IMPOCONSUMO ITEM 121164
DEDI|1094.00
DEIM|0.00|1094.00|0.00|0.00|01|IVA||PA|0.00
DE|6|132374|PA|1.00|8275.63|8275.63||0.00||false
DEDI|CERVZ LAT ORGNL AGUILA 330mlX6u
DEDI|9848.00
DEDIEX||999|1|||
DEIM|1572.37|8275.63|1572.37|19.00|01|IVA||PA|1572.37
DE|7|132376|PA|1.00|2251.00|2251.00||||false
DEDI|IMPOCONSUMO ITEM 132374
DEDI|2251.00
DEIM|0.00|2251.00|0.00|0.00|01|IVA||PA|0.00
DIT|12446.00
DI||3345.00|0.00|0.00|01|0.00|IVA||
DI||65508.00|12446.00|19.00|01|12446.00|IVA||
FP|1|10|2022-02-05|2216017566411
PE|Plantilla|T01_MBS.jasper
PE|CodigoBarras|220366611820014550153
PE|PPLTienda|ST16
PE|PPLCaja|1
PE|prom|0
PE|zona|N/A
PE|idInterno|1 2022036661
PE|CentroDistribucion|MAKRO MONTERIA
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|TelCentroDistribucion|N/A
PE|CorreoDist|
PE|PasaporteCliente|16-210006
PE|BarrioCliente|CERETE
PE|TelefonoCliente|N/A
PE|vrPuntosCMR|0.00
PE|vrEfectivo|100000.00
PE|vrTdebito|0.00
PE|vrCheque|0.00
PE|vrChequePost|0.00
PE|vrBonos|0.00
PE|vrTcredito|0.00
PE|vrTprivada|0.00
PE|vrNotaCredito|0.00
PE|vrCreditoDirecto|0.00
PE|vrDonacion|0.00
PE|vrCambio|-18701.00
PE|Caja|1 455
PE|TotalArticulos|5
PE|TextoFecha|05-02-2022     18:20     1601 2022036661
PES|CentroDist
PESD|1|MAKRO MONTERIA
PESD|2|Cra.  14  No.  48 A 42 
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR IVA RES.00812 30/1/2006
PESD|2|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|Regimen
PESD|1|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|2| AUTORETENEDORES DEL IMPUESTO DE RENTA  
PESD|3| SEGUN RESOL No 1524 DE FEB 20 DE 2006  
PESD|4|        AGENTE RETENEDOR DE IVA         
PESD|5|      RESOLUCION 00812 30/01/2006       
PESD|6|
PESD|7|
PESD|8|
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020       CAMBIOS DENTRO DE LOS 7 DIAS HABILES A   PARTIR DE LA COMPRA,PRESENTA LA FACTURA 
PES|Falabella
PESD|1|Gracias por tu visita
PESD|2|
PESD|3|
CTE||||dte_9000592385@dte.paperless.com.co|
CTR|||||
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope> 